Repository: MahvOS/laundryup
Catalog: lib/l10n/app_*.arb
Languages: id

# appTitle
source: Laundry App
id: Aplikasi Laundry

source: Login
id: Masuk

source: Register
id: Daftar

# emailOrPhone
source: Email / Phone Number
id: Email / No HP

source: Forgot Password?
id: Lupa Password?

# dashboard
source: Customer Dashboard
id: Dashboard Pelanggan

# bookingLaundry
source: Book Laundry
id: Booking Laundry

# statusLaundry
source: Laundry Status
id: Status Cucian

source: Transaction History
id: Riwayat Transaksi

source: Digital Payment
id: Pembayaran Digital

# promoBanner
source: Welcome to our Integrated Laundry System!
id: Selamat datang di Sistem Laundry Terintegrasi!

# selectService
source: Select Service Type:
id: Pilih Jenis Layanan:

source: Dry Wash
id: Cuci Kering

source: Wash & Iron
id: Cuci Setrika

source: Pick Date
id: Pilih Tanggal

source: Pick Time
id: Pilih Jam

source: Delivery Type:
id: Jenis Pengiriman:

source: Pickup
id: Jemput

# selfDrop
source: Self Drop-off
id: Antar Sendiri

# estimatedWeight
source: Estimated Weight (kg):
id: Estimasi Berat (kg):

# expressService
source: Express Service (24 hours):
id: Layanan Express (24 jam):

source: Yes
id: Ya

source: No
id: Tidak

source: Estimated Total
id: Estimasi Total

source: Confirm Booking
id: Konfirmasi Booking

source: Payment Method
id: Metode Pembayaran

# invoiceNote
source: Invoice will be sent automatically after payment.
id: Invoice akan dikirim secara otomatis setelah pembayaran.

source: Settings
id: Pengaturan

source: Language
id: Bahasa

source: Logout
id: Keluar

source: Delete
id: Hapus

source: Indonesian
id: Bahasa Indonesia

source: Booking History:
id: Riwayat Booking:

source: Date:
id: Tanggal:

source: Notes:
id: Catatan:

# confirmDeleteBooking
source: Are you sure you want to delete this booking?
id: Apakah Anda yakin ingin menghapus booking ini?

source: Cancel
id: Batal

# completeBookingData
source: Complete booking data and ensure weight > 0
id: Lengkapi data booking dan pastikan berat > 0

# bookingSuccess
source: Booking successful
id: Booking berhasil

# selectServiceHint
source: Select service
id: Pilih layanan

# enterWeightHint
source: Enter weight in kg
id: Masukkan berat dalam kg

source: Required
id: Wajib diisi

source: Name
id: Nama Panggilan

# paymentTitle
source: Payment
id: Pembayaran

# chooseBookingToPay
source: Choose Order to Pay
id: Pilih Pesanan untuk Dibayar

# paymentMethodText
source: Please choose the payment method that is most convenient for you.
id: Silakan pilih metode pembayaran yang paling nyaman bagi Anda.

# scanQrisDesc
source: Scan the QR code above using your preferred Bank or E-Wallet app.
id: Scan kode QR di atas menggunakan aplikasi Bank atau E-Wallet pilihan Anda.

source: Or
id: Atau

source: Need Help?
id: Butuh Bantuan?

# helpDesc
source: Click the button below to confirm payment or ask for account details via WhatsApp.
id: Klik tombol di bawah untuk konfirmasi pembayaran atau tanya detail rekening melalui WhatsApp.

# contactWa
source: Contact via WhatsApp
id: Hubungi via WhatsApp

# invoiceAutoNote
source: Invoice will be sent automatically after your payment is confirmed by the admin.
id: Invoice akan dikirim secara otomatis setelah pembayaran Anda dikonfirmasi oleh admin.

source: Laundry Progress
id: Progres Laundry

source: Full History
id: Riwayat Lengkap

source: Updated by
id: Diupdate oleh

# doneAt
source: Completed at
id: Selesai pada

source: Total Fees
id: Total Biaya

source: Pay Now (WA)
id: Bayar Sekarang (WA)

# orderNumber
source: Order #
id: Pesanan #

source: Hello
id: Halo

source: See All
id: Lihat Semua

# noOrderHistory
source: No order history yet
id: Belum ada riwayat pesanan

# orderIn
source: Incoming Orders
id: Order Masuk

source: Add New Order
id: Tambah Order Baru

# manualOrderDesc
source: Enter customer order details manually
id: Masukkan rincian pesanan pelanggan secara manual

# customerInfo
source: Customer Information
id: Informasi Pelanggan

source: Service Details
id: Rincian Layanan

# timeAndDelivery
source: Time & Delivery
id: Waktu & Pengiriman

source: Save & Create Order
id: Simpan & Buat Order

# deleteBookingTitle
source: Delete Booking?
id: Hapus Booking?

# deleteBookingConfirm
source: This action will permanently delete this booking from the system.
id: Tindakan ini akan menghapus booking ini secara permanen dari sistem.

# optionalNotes
source: Notes (optional)
id: Catatan (opsional)

# addNotesHint
source: Add notes for customer
id: Tambahkan catatan untuk customer

# todaySummary
source: Today's Summary
id: Ringkasan Hari Ini

source: Quick Actions
id: Tindakan Cepat

source: View Orders
id: Lihat Orderan

source: Pickup Schedule
id: Jadwal Jemput

# latestBooking
source: Latest Bookings
id: Booking Terbaru

source: Contact Customer
id: Hubungi Customer

# noOrders
source: No bookings at the moment
id: Tidak ada booking saat ini

source: Welcome
id: Selamat Datang

# signInDesc
source: Please sign in to continue
id: Silakan masuk untuk melanjutkan

source: Sign Up
id: Daftar Akun

# noAccount
source: Don't have an account?
id: Belum punya akun?

# haveAccount
source: Already have an account?
id: Sudah punya akun?

source: Try Again
id: Coba Lagi

source: User
id: Pengguna

source: Order Detail
id: Detail Pesanan

source: In progress...
id: Dalam proses...

source: Done
id: Selesai

# waError
source: Could not open WhatsApp
id: Tidak dapat membuka WhatsApp

# waMeMessage
source: Hello, I would like to make a payment for my laundry booking.
id: Halo kak, saya ingin melakukan pembayaran untuk booking laundry.

# waMeMessageStatus
source: Hello, I would like to pay for order #{id} ({service}) with a total price of Rp {price}. Please provide further instructions.
id: Halo kak, saya ingin membayar pesanan #{id} ({service}) dengan total harga Rp {price}. Mohon instruksi selanjutnya.

# bookingIdNotFound
source: Booking ID not found. Please create a booking first.
id: ID booking tidak ditemukan. Silakan buat booking terlebih dahulu.

# loadStatusFail
source: Failed to load status data
id: Gagal memuat data status

source: Alert
id: Peringatan

source: Ready to Pickup
id: Siap Diambil

source: Ready to Deliver
id: Siap Dikirim

source: Completed on
id: Selesai pada

source: Completed
id: Selesai

source: In process...
id: Dalam proses...

# selectOperationTime
source: Select Operation Time (Scroll down)
id: Pilih Jam Operasional (Scroll ke bawah)

# operationHours
source: Laundry operation hours
id: Jam operasional laundry

# greetLogin
source: Welcome back! Please login to your account.
id: Selamat datang kembali! Silakan masuk ke akun Anda.

# greetRegister
source: Create a new account to start using our services.
id: Buat akun baru untuk mulai menggunakan layanan kami.

source: WhatsApp Number
id: Nomor WhatsApp

# whatsappRequired
source: WhatsApp number is required
id: Nomor WA diperlukan

# newOrderLabel
source: New
id: Baru

source: Process
id: Proses

# deletedSuccess
source: Deleted successfully
id: Berhasil dihapus

source: Received
id: Diterima

source: Weighed
id: Ditimbang

source: Washed
id: Dicuci

source: Dried
id: Dikeringkan

source: Ironed
id: Disetrika

# contactCustomerMsg
source: Hello {customer}, we would like to confirm the {delivery} schedule for your LaundryUp order.
id: Halo {customer}, kami ingin mengonfirmasi jadwal {delivery} untuk pesanan LaundryUp Anda.

# customerPhoneLabel
source: Phone / WhatsApp Number
id: No HP / WhatsApp

# customerPhoneHint
source: Example: 08123xxx
id: Contoh: 08123xxx

# customerNameLabel
source: Nickname
id: Nama Panggilan

# customerNameHint
source: Enter customer name
id: Masukkan nama pelanggan

# express24
source: Express 24 Hours
id: Express 24 Jam

source: Complete data
id: Lengkapi data

# successAddOrder
source: Order created successfully
id: Order berhasil dibuat

# failLoadBookings
source: Failed to load bookings
id: Gagal memuat booking
